In [3]:
import pandas as pandas
import numpy as np

In [8]:
a = np.nan
a

nan

In [22]:
import pandas as pd

df = pd.DataFrame({
    "Product": ["A", None, None, None, None, "B", "A", "C", "B", "A"]
})

df["Product"].value_counts()

Product
A    3
B    2
C    1
Name: count, dtype: int64

df.dropna()

In [24]:
df

  Product
0       A
1    None
2    None
3    None
4    None
5       B
6       A
7       C
8       B
9       A

In [25]:
df["Product"].value_counts(dropna=False)

Product
None    4
A       3
B       2
C       1
Name: count, dtype: int64

In [26]:
df["Product"].value_counts().sort_index()

Product
A    3
B    2
C    1
Name: count, dtype: int64

In [27]:
df.groupby("Product").size()

Product
A    3
B    2
C    1
dtype: int64

In [28]:
df

  Product
0       A
1    None
2    None
3    None
4    None
5       B
6       A
7       C
8       B
9       A

### Category

In [30]:
import pandas as pd

df = pd.DataFrame({
    'City': ['Mumbai', 'Delhi', 'Mumbai', 'Chennai', 'Delhi', 'Mumbai'],
    'Sales': [100, 150, 200, 120, 180, 160]
})

df

      City  Sales
0   Mumbai    100
1    Delhi    150
2   Mumbai    200
3  Chennai    120
4    Delhi    180
5   Mumbai    160

In [31]:
df['City'].dtype

dtype('O')

In [35]:
df['City'].memory_usage(deep=True)

411

In [32]:
df['City'] = df['City'].astype('category')

In [36]:
df['City'].memory_usage(deep=True)

411

In [33]:
df['City'].dtype

CategoricalDtype(categories=['Chennai', 'Delhi', 'Mumbai'], ordered=False, categories_dtype=object)

In [34]:
df['City'].cat.codes

0    2
1    1
2    2
3    0
4    1
5    2
dtype: int8

In [37]:
import pandas as pd

df = pd.DataFrame({
    'Age': [22, 25, 47, 52, 46],
    'Salary': [25000, 32000, 58000, 72000, 60000]
})

df

   Age  Salary
0   22   25000
1   25   32000
2   47   58000
3   52   72000
4   46   60000

In [39]:
#Min Max
df_norm = (df - df.min()) / (df.max() - df.min())
df_norm

        Age    Salary
0  0.000000  0.000000
1  0.100000  0.148936
2  0.833333  0.702128
3  1.000000  1.000000
4  0.800000  0.744681

In [44]:
import pandas as pd
import numpy as np
df = pd.DataFrame({
    'Score': [35, 48, 62, 74, 88, 95]
})